Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum
The types of enumerator available.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.ALL_SELECTED
Selects all user selected objects from the model.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.ALL_OBJECTS
Selects all objects from the model.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.MODELOBJECT_CHILDREN
Selects children of specified type of given ModelObject

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.BY_FILTER_NAME
Selects all the ModelObjects for a given filter name

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.CONNECTED_COMPONENTS
Selects all connected components of given ModelObject

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.BY_BOUNDING_BOX
Selects all objects intersecting with given bounding box

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.ALL_OBJECTS_WITH_TYPE
All Objects with type given in type in the "subtype".

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.REFERENCE_MODEL_OBJECTS
Selects sub objects of given ReferenceModel.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.MODELOBJECT_FATHERS
Selects fathers of specified type of given ModelObject (Tasks mainly)

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.CONNECTED_DEPENDENCIES
Selects all connected dependencies of given ModelObject (Tasks mainly)

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.TASKS_OF_SELECTED_OBJECTS
Selects all tasks of selected objects

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.MODIFIED_OBJECTS_AFTER_STAMP
Selects all modified and created objects

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.FILTERED_OBJECTS_WITH_TYPE
Filtered objects with type given in type in the "subtype".

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.DELETED_OBJECTS_AFTER_STAMP
Selects all modified objects

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.ALL_PRESELECTED
Selects all preselected objects.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.BY_BOUNDING_BOX_AND_VIEW
Selects all objects that intersect with the given bounding box and that are visible in the given view.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.CONVERTED_FROM_REFERENCE_MODEL
Selects objects that were converted from a given reference model (if they weren't unlinked)

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.ATTRIBUTE_MODIFIED_OBJECTS_AFTER_STAMP
Selects all objects of which attributes (UDA) have been modified after the stamp.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.NUMBERING_MODIFIED_OBJECTS_AFTER_STAMP
Selects all objects of which numbering has been modified after the stamp.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.CREATED_OBJECTS_AFTER_STAMP
Selects all created objects

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.MODIFIED_OBJECTS_BY_FILTER_NAME
Selects all objects which are new, modified, numbered or which phase has changed after the stamp and pass the filter of given name.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.PHASE_MODIFIED_OBJECTS_AFTER_STAMP
Selects all objects of which phase has been modified after the stamp.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.OBJECTS_WITH_ANY_MODIFICATION_AFTER_STAMP
Selects all objects with any type of modification or are created after the stamp.

Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum.BY_MODEL_OBJECT_TYPE
Selects all model objects with the specified type.